package org.example;

// Создать класс Поток, содержащий в себе список УчебныхГрупп
// и реализующий интерфейс Iterable;
// Создать класс StreamComparator, реализующий сравнение количества групп,
// входящих в Поток;
// Создать класс ПотокСервис, добавив в него метод сортировки списка потоков,
// используя созданный StreamComparator;
//Модифицировать класс Контроллер, добавив в него созданный сервис;
// Модифицировать класс Контроллер, добавив в него метод, сортирующий список потоков,
// путём вызова созданного сервиса.

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}